SteveLRojas/mcu_libs/STM32F205/stm32f205_uart/user_libs/stm32f205_core.h
/* SysTick_clock_source */
#define SysTick_CLKSource_HCLK_Div8	0x00000000UL
#define SysTick_CLKSource_HCLK		0x00000004UL

#define core_systick_clk_src_config(clk_src) (SysTick->CTRL = (SysTick->CTRL & ~SysTick_CTRL_CLKSOURCE_Msk) | (clk_src))

__attribute__( ( always_inline ) ) static inline void core_enable_global_irq()               { __asm volatile ("cpsie i"); }
__attribute__( ( always_inline ) ) static inline void core_disable_global_irq()              { __asm volatile ("cpsid i"); }

__attribute__( ( always_inline ) ) static inline void core_enable_fault_irq()         { __asm volatile ("cpsie f"); }
__attribute__( ( always_inline ) ) static inline void core_disable_fault_irq()        { __asm volatile ("cpsid f"); }

__attribute__( ( always_inline ) ) static inline void core_nop()                      { __asm volatile ("nop"); }
__attribute__( ( always_inline ) ) static inline void core_wfi()                      { __asm volatile ("wfi"); }
__attribute__( ( always_inline ) ) static inline void core_wfe()                      { __asm volatile ("wfe"); }
__attribute__( ( always_inline ) ) static inline void core_sev()                      { __asm volatile ("sev"); }
__attribute__( ( always_inline ) ) static inline void core_isb()                      { __asm volatile ("isb"); }
__attribute__( ( always_inline ) ) static inline void core_dsb()                      { __asm volatile ("dsb"); }
__attribute__( ( always_inline ) ) static inline void core_dmb()                      { __asm volatile ("dmb"); }
__attribute__( ( always_inline ) ) static inline void core_clrex()                    { __asm volatile ("clrex"); }

/* Set the priority grouping field using the required unlock sequence.
 * The parameter priority_grouping is assigned to the field
 * SCB->AIRCR [10:8] PRIGROUP field. Only values from 0..7 are used.
 * In case of a conflict between priority grouping and available
 * priority bits (__NVIC_PRIO_BITS) the smallest possible priority group is set. */
static inline void core_nvic_set_priority_grouping(uint32_t PriorityGroup)
{
  uint32_t reg_value;
  uint32_t PriorityGroupTmp = (PriorityGroup & 0x07);                         /* only values 0..7 are used          */

  reg_value  =  SCB->AIRCR;                                                   /* read old register configuration    */
  reg_value &= ~(SCB_AIRCR_VECTKEY_Msk | SCB_AIRCR_PRIGROUP_Msk);             /* clear bits to change               */
  reg_value  =  (reg_value                       |
                (0x5FA << SCB_AIRCR_VECTKEY_Pos) |
                (PriorityGroupTmp << 8));                                     /* Insert write key and priorty group */
  SCB->AIRCR =  reg_value;
}

/* Get the priority grouping from NVIC Interrupt Controller.
 * priority grouping is SCB->AIRCR [10:8] PRIGROUP field. */
static inline uint32_t core_nvic_get_priority_grouping(void)
{
  return ((SCB->AIRCR & SCB_AIRCR_PRIGROUP_Msk) >> SCB_AIRCR_PRIGROUP_Pos);   /* read priority grouping field */
}

/* Enable a device specific interrupt in the NVIC interrupt controller.
 * The interrupt number cannot be a negative value. */
static inline void core_nvic_enable_irq(IRQn_Type IRQn)
{
  NVIC->ISER[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F)); /* enable interrupt */
}

/* Disable a device specific interrupt in the NVIC interrupt controller.
 * The interrupt number cannot be a negative value. */
static inline void core_nvic_disable_irq(IRQn_Type IRQn)
{
  NVIC->ICER[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F)); /* disable interrupt */
}

/* Read the pending register in NVIC and return 1 if its status is pending, otherwise it returns 0 */
static inline uint32_t core_nvic_get_pending_irq(IRQn_Type IRQn)
{
  return((uint32_t) ((NVIC->ISPR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0)); /* Return 1 if pending else 0 */
}

/* Set the pending bit for the specified interrupt.
 * The interrupt number cannot be a negative value. */
static inline void core_nvic_set_pending_irq(IRQn_Type IRQn)
{
  NVIC->ISPR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F)); /* set interrupt pending */
}

/* Clear the pending bit for the specified interrupt.
 * The interrupt number cannot be a negative value. */
static inline void core_nvic_clear_pending_irq(IRQn_Type IRQn)
{
  NVIC->ICPR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F)); /* Clear pending interrupt */
}

/* Read the active register in NVIC and returns 1 if its status is active, otherwise it returns 0. */
static inline uint32_t core_nvic_get_active(IRQn_Type IRQn)
{
  return((uint32_t)((NVIC->IABR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0)); /* Return 1 if active else 0 */
}

/* Set the priority for the specified interrupt. The interrupt
 * number can be positive to specify an external (device specific)
 * interrupt, or negative to specify an internal (core) interrupt.
 *
 * Note: The priority cannot be set for every core interrupt. */
static inline void core_nvic_set_priority(IRQn_Type IRQn, uint32_t priority)
{
  if(IRQn < 0) {
    SCB->SHP[((uint32_t)(IRQn) & 0xF)-4] = ((priority << (8 - __NVIC_PRIO_BITS)) & 0xff); } /* set Priority for Cortex-M3 System Interrupts */
  else {
    NVIC->IP[(uint32_t)(IRQn)] = ((priority << (8 - __NVIC_PRIO_BITS)) & 0xff);    }        /* set Priority for device specific Interrupts  */
}

/* Read the priority for the specified interrupt. The interrupt
 * number can be positive to specify an external (device specific)
 * interrupt, or negative to specify an internal (core) interrupt.
 *
 * The returned priority value is automatically aligned to the implemented
 * priority bits of the microcontroller.
 *
 * Note: The priority cannot be set for every core interrupt. */
static inline uint32_t core_nvic_get_priority(IRQn_Type IRQn)
{

  if(IRQn < 0) {
    return((uint32_t)(SCB->SHP[((uint32_t)(IRQn) & 0xF)-4] >> (8 - __NVIC_PRIO_BITS)));  } /* get priority for Cortex-M3 system interrupts */
  else {
    return((uint32_t)(NVIC->IP[(uint32_t)(IRQn)]           >> (8 - __NVIC_PRIO_BITS)));  } /* get priority for device specific interrupts  */
}

/* Encode the priority for an interrupt with the given priority group,
 * preemptive priority value and sub priority value.
 * In case of a conflict between priority grouping and available
 * priority bits (__NVIC_PRIO_BITS) the smallest possible priority group is set.
 *
 * The returned priority value can be used for NVIC_SetPriority(...) function */
static inline uint32_t core_nvic_encode_priority (uint32_t PriorityGroup, uint32_t PreemptPriority, uint32_t SubPriority)
{
  uint32_t PriorityGroupTmp = (PriorityGroup & 0x07);          /* only values 0..7 are used          */
  uint32_t PreemptPriorityBits;
  uint32_t SubPriorityBits;

  PreemptPriorityBits = ((7 - PriorityGroupTmp) > __NVIC_PRIO_BITS) ? __NVIC_PRIO_BITS : 7 - PriorityGroupTmp;
  SubPriorityBits     = ((PriorityGroupTmp + __NVIC_PRIO_BITS) < 7) ? 0 : PriorityGroupTmp - 7 + __NVIC_PRIO_BITS;

  return (
           ((PreemptPriority & ((1 << (PreemptPriorityBits)) - 1)) << SubPriorityBits) |
           ((SubPriority     & ((1 << (SubPriorityBits    )) - 1)))
         );
}

/* Decode an interrupt priority value with the given priority group to
 * preemptive priority value and sub priority value.
 * In case of a conflict between priority grouping and available
 * priority bits (__NVIC_PRIO_BITS) the smallest possible priority group is set.
 *
 * The priority value can be retrieved with NVIC_GetPriority(...) function */
static inline void core_nvic_decode_priority (uint32_t Priority, uint32_t PriorityGroup, uint32_t* pPreemptPriority, uint32_t* pSubPriority)
{
  uint32_t PriorityGroupTmp = (PriorityGroup & 0x07);          /* only values 0..7 are used */
  uint32_t PreemptPriorityBits;
  uint32_t SubPriorityBits;

  PreemptPriorityBits = ((7 - PriorityGroupTmp) > __NVIC_PRIO_BITS) ? __NVIC_PRIO_BITS : 7 - PriorityGroupTmp;
  SubPriorityBits     = ((PriorityGroupTmp + __NVIC_PRIO_BITS) < 7) ? 0 : PriorityGroupTmp - 7 + __NVIC_PRIO_BITS;

  *pPreemptPriority = (Priority >> SubPriorityBits) & ((1 << (PreemptPriorityBits)) - 1);
  *pSubPriority     = (Priority                   ) & ((1 << (SubPriorityBits    )) - 1);
}

/* Initiate a system reset request to reset the MCU */
static inline void core_nvic_system_reset(void)
{
  SCB->AIRCR  = ((0x5FA << SCB_AIRCR_VECTKEY_Pos)      |
                 (SCB->AIRCR & SCB_AIRCR_PRIGROUP_Msk) |
                 SCB_AIRCR_SYSRESETREQ_Msk);                   /* Keep priority group unchanged */
  core_dsb();                                                     /* Ensure completion of memory access */
  while(1);                                                    /* wait until reset */
}

/* Initialize the system tick timer and its interrupt and start the
 * system tick timer / counter in free running mode to generate
 * periodical interrupts. */
static inline uint32_t SysTick_Config(uint32_t ticks)
{
  if (ticks > SysTick_LOAD_RELOAD_Msk)  return (1);            /* Reload value impossible */

  SysTick->LOAD  = (ticks & SysTick_LOAD_RELOAD_Msk) - 1;      /* set reload register */
  core_nvic_set_priority (SysTick_IRQn, (1<<__NVIC_PRIO_BITS) - 1);  /* set Priority for Cortex-M0 System Interrupts */
  SysTick->VAL   = 0;                                          /* Load the SysTick Counter Value */
  SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk |
                   SysTick_CTRL_TICKINT_Msk   |
                   SysTick_CTRL_ENABLE_Msk;                    /* Enable SysTick IRQ and SysTick Timer */
  return (0);                                                  /* Function successful */
}

void core_delay_init(void);
void core_delay_us(uint32_t n);
void core_delay_ms(uint16_t n);
uint32_t core_get_psp(void);
void core_set_psp(uint32_t topOfProcStack);
uint32_t core_get_msp(void);
void core_set_msp(uint32_t topOfMainStack);
uint32_t core_get_basepri(void);
void core_set_basepri(uint32_t value);
uint32_t core_get_primask(void);
void core_set_primask(uint32_t priMask);
uint32_t core_get_faultmask(void);
void core_set_faultmask(uint32_t faultMask);
uint32_t core_get_control(void);
void core_set_control(uint32_t control);
uint32_t core_rev(uint32_t value);
uint32_t core_rev16(uint16_t value);
int32_t core_revsh(int16_t value);
uint32_t core_rbit(uint32_t value);
uint8_t core_ldrexb(uint8_t *addr);
uint16_t core_ldrexh(uint16_t *addr);
uint32_t core_ldrexw(uint32_t *addr);
uint32_t core_strexb(uint8_t value, uint8_t *addr);
uint32_t core_strexh(uint16_t value, uint16_t *addr);
uint32_t core_strexw(uint32_t value, uint32_t *addr);

#endif /* _STM32F205_CORE_H_ */
